[command]/home/runner/work/_temp/f06a228b-0012-47f7-8efc-fb19766f3365/terraform-bin plan -no-color
module.storage_bucket.google_storage_bucket.my_bucket: Refreshing state... [id=testing-cicdanu-prod2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.storage_bucket.google_storage_bucket.my_bucket must be replaced
-/+ resource "google_storage_bucket" "my_bucket" {
      - default_event_based_hold    = false -> null
      - enable_object_retention     = false -> null
      ~ id                          = "testing-cicdanu-prod2" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "testing-cicdanu-prod2" -> "testing-cicdanu-one-last-prod2" # forces replacement
      ~ project                     = "vishal-project-442115" -> (known after apply)
      ~ project_number              = 807601311613 -> (known after apply)
      ~ public_access_prevention    = "inherited" -> (known after apply)
      - requester_pays              = false -> null
      ~ rpo                         = "DEFAULT" -> (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/testing-cicdanu-prod2" -> (known after apply)
      ~ uniform_bucket_level_access = false -> (known after apply)
      ~ url                         = "gs://testing-cicdanu-prod2" -> (known after apply)
        # (5 unchanged attributes hidden)

      - hierarchical_namespace {
          - enabled = false -> null
        }

      ~ soft_delete_policy (known after apply)
      - soft_delete_policy {
          - effective_time             = "2024-11-23T00:52:13.026Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      ~ website (known after apply)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: module.storage_bucket.google_storage_bucket.my_bucket: Refreshing state... [id=testing-cicdanu-prod2]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.storage_bucket.google_storage_bucket.my_bucket must be replaced%0A-/+ resource "google_storage_bucket" "my_bucket" {%0A      - default_event_based_hold    = false -> null%0A      - enable_object_retention     = false -> null%0A      ~ id                          = "testing-cicdanu-prod2" -> (known after apply)%0A      - labels                      = {} -> null%0A      ~ name                        = "testing-cicdanu-prod2" -> "testing-cicdanu-one-last-prod2" # forces replacement%0A      ~ project                     = "vishal-project-442115" -> (known after apply)%0A      ~ project_number              = 807601311613 -> (known after apply)%0A      ~ public_access_prevention    = "inherited" -> (known after apply)%0A      - requester_pays              = false -> null%0A      ~ rpo                         = "DEFAULT" -> (known after apply)%0A      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/testing-cicdanu-prod2" -> (known after apply)%0A      ~ uniform_bucket_level_access = false -> (known after apply)%0A      ~ url                         = "gs://testing-cicdanu-prod2" -> (known after apply)%0A        # (5 unchanged attributes hidden)%0A%0A      - hierarchical_namespace {%0A          - enabled = false -> null%0A        }%0A%0A      ~ soft_delete_policy (known after apply)%0A      - soft_delete_policy {%0A          - effective_time             = "2024-11-23T00:52:13.026Z" -> null%0A          - retention_duration_seconds = 604800 -> null%0A        }%0A%0A      ~ website (known after apply)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0APlan: 1 to add, 0 to change, 1 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

<!-- Sticky Pull Request Comment -->